{
  "title": "Profil SMK Setia Karya",
  "subtitle": "Lebih dari 25 tahun mengabdi dalam dunia pendidikan, membentuk generasi cerdas, berkarakter, dan berprestasi untuk kemajuan bangsa Indonesia",
  "image": {
    "src": "https://images.unsplash.com/photo-1562774053-701939374585?w=1200&h=400&fit=crop",
    "alt": "Kampus SMK Setia Karya"
  },
  "history": "SMK Setia Karya memulai perjalanannya pada tahun 1998 dengan visi mulia untuk memberikan pendidikan berkualitas bagi generasi muda Indonesia. Didirikan oleh sekelompok pendidik visioner yang memahami pentingnya pendidikan kejuruan dalam mempersiapkan siswa menghadapi dunia kerja, sekolah ini dimulai dengan fasilitas sederhana namun semangat yang luar biasa. Awalnya, SMK Setia Karya hanya memiliki 3 ruang kelas, 90 siswa, dan 12 guru. Namun, dengan tekad yang kuat, sekolah ini terus berkembang menjadi institusi pendidikan yang membentuk karakter dan kompetensi siswa.\n\nMemasuki periode 2005–2015, SMK Setia Karya mengalami fase ekspansi yang signifikan. Dukungan dari berbagai pihak memungkinkan pembangunan gedung-gedung baru, laboratorium modern, serta fasilitas olahraga yang lengkap. Pada masa ini pula, sekolah mulai membuka program-program studi baru yang disesuaikan dengan kebutuhan industri.\n\nPuncak pencapaian datang pada tahun 2010, ketika SMK Setia Karya berhasil meraih akreditasi A dari BAN-S/M, sebagai pengakuan atas kualitas pendidikan yang telah dibangun. Hingga kini, jumlah siswa meningkat drastis menjadi lebih dari 1.500 orang, dengan tenaga pendidik yang mencapai 80 orang.",
  "statistics": {
    "title": "SMK Setia Karya dalam Angka",
    "items": [
      {
        "label": "Tahun Berdiri",
        "value": "2010",
        "icon": "building"
      },
      {
        "label": "Total Alumni",
        "value": "1000+",
        "icon": "users"
      },
      {
        "label": "Prestasi Diraih",
        "value": "2",
        "icon": "award"
      },
      {
        "label": "Program Studi",
        "value": "6",
        "icon": "book"
      }
    ]
  },
  "certification": {
    "title": "Akreditasi & Sertifikasi",
    "items": [
      {
        "label": "Akreditasi A",
        "value": "BAN-S/M",
        "year": "2020-2025",
        "icon": "building"
      },
      {
        "label": "Sekolah Penggerak",
        "value": "Kemendikbud",
        "year": "2021",
        "icon": "users"
      },
      {
        "label": "ISO 9001:2015",
        "value": "Manajemen Mutu",
        "year": "2019",
        "icon": "award"
      },
      {
        "label": "Sekolah Adiwiyata",
        "value": "Lingkungan Hidup",
        "year": "2020",
        "icon": "book"
      }
    ]
  }
}
