{
  "profil": {
    "nama": "SMK Setia Karya",
    "tahunBerdiri": 2015,
    "status": "Swasta",
    "akreditasi": "A",
    "npsn": "20401234",
    "sejarah": {
      "singkat": "SMK Setia Karya didirikan pada tahun 2015 dengan visi mencetak lulusan yang kompeten di bidang teknologi dan otomotif.",
      "detail": "Berawal dari kebutuhan industri akan tenaga kerja terampil di bidang teknologi dan otomotif, SMK Setia Karya hadir untuk menjawab tantangan tersebut. Dengan dukungan penuh dari pemerintah daerah dan mitra industri, sekolah ini terus berkembang menjadi lembaga pendidikan vokasi yang terdepan."
    },
    "statistik": {
      "totalSiswa": 850,
      "totalGuru": 45,
      "totalStaff": 15,
      "tingkatKelulusan": 98,
      "totalAlumni": 2500,
      "mitraIndustri": 25
    }
  },
  "visiMisi": {
    "visi": "Menjadi sekolah menengah kejuruan yang unggul dalam menghasilkan lulusan yang berkarakter, kompeten, dan siap kerja di era digital.",
    "misi": [
      "Menyelenggarakan pendidikan kejuruan yang berkualitas dan sesuai dengan kebutuhan industri",
      "Mengembangkan karakter siswa yang berakhlak mulia dan berjiwa wirausaha",
      "Menyediakan fasilitas pembelajaran yang modern dan berbasis teknologi",
      "Menjalin kerjasama yang erat dengan dunia usaha dan dunia industri",
      "Menghasilkan lulusan yang kompeten dan siap bersaing di pasar kerja global"
    ],
    "tujuan": [
      "Meningkatkan mutu pendidikan kejuruan yang relevan dengan kebutuhan industri",
      "Menghasilkan lulusan yang memiliki kompetensi tinggi dan daya saing global",
      "Mengembangkan jiwa kewirausahaan dan kemandirian siswa",
      "Menciptakan lingkungan belajar yang kondusif dan inovatif"
    ]
  },
  "nilaiInti": {
    "setia": {
      "nama": "SETIA",
      "deskripsi": "Komitmen terhadap kejujuran, integritas, dan loyalitas dalam setiap tindakan"
    },
    "karya": {
      "nama": "KARYA",
      "deskripsi": "Semangat berkreasi, berinovasi, dan menghasilkan karya yang bermanfaat"
    },
    "integritas": {
      "nama": "Integritas",
      "deskripsi": "Konsistensi antara nilai, perkataan, dan perbuatan"
    },
    "kolaborasi": {
      "nama": "Kolaborasi",
      "deskripsi": "Kemampuan bekerja sama untuk mencapai tujuan bersama"
    }
  },
  "motto": "Berkarya dengan Setia, Meraih Masa Depan Gemilang"
}